class UniversityAcademicData {
  static const List<String> colleges = [
    'كلية الطب والعلوم الصحية',
    'كلية الهندسة وتكنولوجيا المعلومات',
    'كلية العلوم الإدارية والإنسانية',
  ];

  static const Map<String, List<String>> majorsByCollege = {
    'كلية الطب والعلوم الصحية': [
      'طب وجراحة عامة',
      'طب الأسنان',
      'الصيدلة السريرية',
      'المختبرات الطبية',
      'طب الطوارئ',
    ],
    'كلية الهندسة وتكنولوجيا المعلومات': [
      'هندسة الميكاترونكس',
      'هندسة الطاقة المتجددة',
      'الهندسة الطبية الحيوية',
      'تكنولوجيا المعلومات IT',
      'الأمن السيبراني',
      'الذكاء الاصطناعي',
      'التصميم الداخلي',
    ],
    'كلية العلوم الإدارية والإنسانية': [
      'نظم المعلومات الإدارية',
      'إدارة الأعمال الدولية',
      'العلوم المالية والمصرفية',
      'التسويق الرقمي',
      'المحاسبة',
      'الترجمة',
      'الإعلام الجديد',
      'القانون',
    ],
  };

  static const List<String> levels = [
    'المستوى الأول',
    'المستوى الثاني',
    'المستوى الثالث',
    'المستوى الرابع',
    'المستوى الخامس',
    'المستوى السادس',
  ];

  static const List<String> terms = [
    'الفصل الأول',
    'الفصل الثاني',
    'الفصل الصيفي',
  ];
}
